#!/bin/bash
# Да се напише shell скрипт, който валидира дали дадено цяло число попада в целочислен интервал.
# Скриптът приема 3 аргумента: числото, което трябва да се провери; лява граница на интервала; дясна граница на интервала.
# Скриптът да връща exit status:
# - 3, когато поне един от трите аргумента не е цяло число
# - 2, когато границите на интервала са обърнати
# - 1, когато числото не попада в интервала
# - 0, когато числото попада в интервала

if [[ $# -ne 3 ]]; then
	echo "Invalid number of arguments"
	exit 42
fi
num_regex="^[+-]?[0-9]+[.][0-9]+$"
if [[ ! $1 =~ $num_regex || ! $2 =~ $num_regex || ! $3 =~ $num_regex ]]; then
        exit 3
fi

if [[ $1 -lt $3 && $1 -gt $2 ]]; then
	exit 0
elif [[ $3 -lt $2 ]]; then
	exit 2
elif [[ $1 -lt $2 || $1 -gt $3 ]]; then
	exit 1
fi

